# Load Data
## Loading
- This notebook loads the trip data and taxi zone data into a SQL database

## Feature Engineering
- time: create hour and day of week features
- platforms: create platform variable (e.g. 'Uber', 'Lyft', etc)
- tips: indicator for whether a customer tipped
- driver pay metrics: pay per minute and pay per mile

In [40]:
import pandas as pd
import pyarrow.parquet as pq
%matplotlib inline
import os

In [8]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/uber')
engine.connect()

%load_ext sql
%sql postgresql://root:root@localhost:5432/uber

In [15]:
%%sql
CREATE TABLE main;

 * postgresql://root:***@localhost:5432/uber
(psycopg2.errors.SyntaxError) syntax error at or near ";"
LINE 1: CREATE TABLE main;
                         ^

[SQL: CREATE TABLE main;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
for file in os.listdir('../data'):
    print(file)

.DS_Store
fhvhv_tripdata_2019-08.parquet
taxi_zones
taxi+_zone_lookup.csv
fhvhv_tripdata_2019-07.parquet
tableau_data.csv
taxi_zones.zip

In [14]:
fhvhv_datasets = [x for x in os.listdir('../data') if 'fhvhv' in x]
fhvhv_datasets

['fhvhv_tripdata_2019-08.parquet', 'fhvhv_tripdata_2019-07.parquet']

### Uber Data

In [49]:
# limit sample size to keep things sane on local computer
sample_size = 100000

In [50]:
%%sql
DROP TABLE IF EXISTS main;

 * postgresql://root:***@localhost:5432/uber
Done.

[]

In [51]:
for dataset in fhvhv_datasets:
    df = pd.read_parquet('../data/'+dataset)
    df = df.sample(sample_size)
    df.to_sql(name='main', con=engine, if_exists='append')

In [67]:
"""
# alternative method using iter_batches
for dataset in fhvhv_datasets:
    parquet_file = pq.ParquetFile('../data/' + dataset)
    for batch in parquet_file.iter_batches(batch_size=1000):
        df = batch.to_pandas()
        #df = pd.read_parquet('../data/' + dataset)
        #df = df.sample(sample_size)
        df.to_sql(name='main', con=engine, if_exists='append')
"""

"\n\nfor dataset in fhvhv_datasets:\n    parquet_file = pq.ParquetFile('../data/' + dataset)\n    for batch in parquet_file.iter_batches(batch_size=1000):\n        df = batch.to_pandas()\n        #df = pd.read_parquet('../data/' + dataset)\n        #df = df.sample(sample_size)\n        df.to_sql(name='main', con=engine, if_exists='append')\n"

In [53]:
%%sql
SELECT 
MIN(request_datetime) ,
MAX(request_datetime) 
FROM 
main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(datetime.datetime(2019, 6, 30, 23, 48, 5), datetime.datetime(2019, 8, 31, 23, 56, 55))]

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 1962725 to 8207163
Data columns (total 24 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   hvfhs_license_num     100000 non-null  object
 1   dispatching_base_num  100000 non-null  object
 2   originating_base_num  72347 non-null   object
 3   request_datetime      100000 non-null  datetime64[us]
 4   on_scene_datetime     72347 non-null   datetime64[us]
 5   pickup_datetime       100000 non-null  datetime64[us]
 6   dropoff_datetime      100000 non-null  datetime64[us]
 7   PULocationID          100000 non-null  int64
 8   DOLocationID          100000 non-null  int64
 9   trip_miles            100000 non-null  float64
 10  trip_time             100000 non-null  int64
 11  base_passenger_fare   100000 non-null  float64
 12  tolls                 100000 non-null  float64
 13  bcf                   100000 non-null  float64
 14  sales_tax             100000 non-null  float64
 15  congestion_surcharge  100000 non-null  float64
 16  airport_fee           0 non-null       float64
 17  tips                  100000 non-null  float64
 18  driver_pay            100000 non-null  float64
 19  shared_request_flag   100000 non-null  object
 20  shared_match_flag     100000 non-null  object
 21  access_a_ride_flag    100000 non-null  object
 22  wav_request_flag      100000 non-null  object
 23  wav_match_flag        100000 non-null  object
dtypes: datetime64[us](4), float64(9), int64(3), object(8)
memory usage: 19.1+ MB

### Taxi Zones

In [55]:
taxi_zones = pd.read_csv('../data/taxi+_zone_lookup.csv')
taxi_zones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

In [56]:
taxi_zones

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [57]:
taxi_zones.to_sql(name='zones', con=engine, if_exists='replace')

265

In [58]:
%%sql
DELETE FROM zones 
WHERE service_zone IS NULL;

 * postgresql://root:***@localhost:5432/uber
2 rows affected.

[]

### Main

In [59]:
%%sql
-- basic query
SELECT * FROM main LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(10840404, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 17, 15, 59, 10), None, datetime.datetime(2019, 8, 17, 16, 2, 35), datetime.datetime(2019, 8, 17, 16, 32, 28), 143, 145, 4.239, 1793, 19.41, 0.16, 0.49, 1.74, 2.75, None, 0.0, 19.44, 'N', 'N', 'N', 'N', 'N'),
 (2252549, 'HV0003', 'B02870', 'B02870', datetime.datetime(2019, 8, 4, 3, 15, 51), datetime.datetime(2019, 8, 4, 3, 24, 27), datetime.datetime(2019, 8, 4, 3, 24, 27), datetime.datetime(2019, 8, 4, 3, 31, 54), 80, 198, 1.54, 447, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (13745783, 'HV0003', 'B02879', 'B02879', datetime.datetime(2019, 8, 22, 7, 42, 4), datetime.datetime(2019, 8, 22, 7, 43, 54), datetime.datetime(2019, 8, 22, 7, 45, 32), datetime.datetime(2019, 8, 22, 7, 50, 41), 69, 119, 1.32, 308, 3.85, 0.0, 0.0, 0.33, 0.0, None, 0.0, 5.39, 'N', 'N', ' ', 'N', 'N'),
 (2620430, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 4, 17, 25, 30), None, datetime.datetime(2019, 8, 4, 17, 29, 54), datetime.datetime(2019, 8, 4, 17, 43, 10), 144, 162, 2.85, 796, 19.74, 0.0, 0.49, 1.75, 2.75, None, 3.71, 9.7, 'N', 'N', 'N', 'N', 'N'),
 (3601407, 'HV0003', 'B02875', 'B02875', datetime.datetime(2019, 8, 6, 12, 8, 15), datetime.datetime(2019, 8, 6, 12, 8, 25), datetime.datetime(2019, 8, 6, 12, 10, 25), datetime.datetime(2019, 8, 6, 12, 21, 24), 244, 119, 3.1, 636, 9.34, 0.0, 0.0, 0.81, 0.0, None, 0.0, 8.83, 'N', 'N', ' ', 'N', 'N'),
 (2863573, 'HV0003', 'B02869', 'B02869', datetime.datetime(2019, 8, 5, 5, 0, 6), datetime.datetime(2019, 8, 5, 5, 0, 12), datetime.datetime(2019, 8, 5, 5, 2, 47), datetime.datetime(2019, 8, 5, 5, 13, 18), 167, 213, 3.5, 632, 17.76, 0.0, 0.0, 1.54, 0.0, None, 0.0, 13.57, 'N', 'N', ' ', 'N', 'N'),
 (7773871, 'HV0003', 'B02883', 'B02883', datetime.datetime(2019, 8, 12, 19, 49, 50), datetime.datetime(2019, 8, 12, 19, 50, 1), datetime.datetime(2019, 8, 12, 19, 52, 26), datetime.datetime(2019, 8, 12, 20, 3, 52), 125, 148, 1.64, 675, 11.5, 0.0, 0.0, 1.0, 2.75, None, 0.0, 7.45, 'N', 'N', ' ', 'N', 'N'),
 (13497465, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 21, 18, 57, 26), None, datetime.datetime(2019, 8, 21, 19, 2, 31), datetime.datetime(2019, 8, 21, 19, 36, 55), 186, 229, 2.796, 2064, 11.35, 0.0, 0.28, 1.01, 0.75, None, 0.0, 0.0, 'Y', 'Y', 'N', 'N', 'N'),
 (12036795, 'HV0003', 'B02877', 'B02877', datetime.datetime(2019, 8, 19, 9, 28, 33), datetime.datetime(2019, 8, 19, 9, 30, 20), datetime.datetime(2019, 8, 19, 9, 31, 26), datetime.datetime(2019, 8, 19, 9, 34, 50), 119, 247, 0.84, 203, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (13943106, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 22, 14, 0, 58), None, datetime.datetime(2019, 8, 22, 14, 5, 32), datetime.datetime(2019, 8, 22, 15, 6, 48), 36, 48, 9.696, 3676, 31.48, 0.0, 0.86, 3.06, 0.75, None, 0.0, 0.0, 'Y', 'Y', 'N', 'N', 'N')]

### Hour and Day of Week

In [60]:
%%sql
ALTER TABLE main
ADD pickup_hour INT;

UPDATE main
SET pickup_hour = CAST(EXTRACT(hour FROM pickup_datetime) AS int)

 * postgresql://root:***@localhost:5432/uber
Done.
200000 rows affected.

[]

In [61]:
%%sql
ALTER TABLE main
ADD pickup_dayofweek varchar(15);

ALTER TABLE main
ADD pickup_dayofweek_int INT;

UPDATE main 
SET pickup_dayofweek_int = CAST(
        EXTRACT(isodow FROM pickup_datetime) 
    AS INT);

UPDATE main 
SET pickup_dayofweek = 
CASE 
    WHEN pickup_dayofweek_int = 1 THEN 'Monday'
    WHEN pickup_dayofweek_int = 2 THEN 'Tuesday'
    WHEN pickup_dayofweek_int = 3 THEN 'Wednesday'
    WHEN pickup_dayofweek_int = 4 THEN 'Thursday'
    WHEN pickup_dayofweek_int = 5 THEN 'Friday'
    WHEN pickup_dayofweek_int = 6 THEN 'Saturday'
    WHEN pickup_dayofweek_int = 7 THEN 'Sunday'
END;

 * postgresql://root:***@localhost:5432/uber
Done.
Done.
200000 rows affected.
200000 rows affected.

[]

In [62]:
%%sql
ALTER TABLE main drop pickup_dayofweek_int;

 * postgresql://root:***@localhost:5432/uber
Done.

[]

### Platforms

In [63]:
%%sql
ALTER TABLE main 
ADD platform varchar(10);

UPDATE main 
SET platform = 
CASE 
    WHEN Hvfhs_license_num = 'HV0002' THEN 'Juno'
    WHEN Hvfhs_license_num = 'HV0003' THEN 'Uber'
    WHEN Hvfhs_license_num = 'HV0004' THEN 'Via'
    WHEN Hvfhs_license_num = 'HV0005' THEN 'Lyft'
END;

 * postgresql://root:***@localhost:5432/uber
Done.
200000 rows affected.

[]

### Tips

In [64]:
%%sql
ALTER TABLE main 
ADD has_tips INT;

UPDATE main 
SET has_tips = CAST(tips > 0 AS INT);

 * postgresql://root:***@localhost:5432/uber
Done.
200000 rows affected.

[]

### Driver Pay

In [65]:
%%sql
ALTER TABLE main 
ADD driver_pay_per_mile real DEFAULT NULL;

UPDATE main
SET driver_pay_per_mile = (driver_pay / trip_miles)::numeric
WHERE trip_miles > 0;

 * postgresql://root:***@localhost:5432/uber
Done.
199938 rows affected.

[]

In [66]:
%%sql
ALTER TABLE main 
ADD driver_pay_per_minute real DEFAULT NULL;

UPDATE main
SET driver_pay_per_minute = (driver_pay / (trip_time/60.0))::numeric
WHERE trip_time > 0;

 * postgresql://root:***@localhost:5432/uber
Done.
200000 rows affected.

[]